# ------------------------------------------------------------
# 프론트엔드 보안 그룹 출력값
# ------------------------------------------------------------
output "frontend_sg_id" {
  description = "프론트엔드 보안 그룹 ID"
  value       = aws_security_group.frontend_sg.id
}

# ------------------------------------------------------------
# 백엔드 보안 그룹 출력값
# ------------------------------------------------------------
output "backend_sg_id" {
  description = "백엔드 보안 그룹 ID"
  value       = aws_security_group.backend_sg.id
}

# ------------------------------------------------------------
# DB 보안 그룹 출력값
# ------------------------------------------------------------
output "db_sg_id" {
  description = "DB 보안 그룹 ID"
  value       = aws_security_group.db_sg.id
} 